# RefTableElemName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RefTableElemName Property
ParameterTypeId Class See Also
---
"Key Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RefTableElemName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RefTableElemName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RefTableElemName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace